wiki/Eclipse.org
#+TITLE:       Eclipse
#+AUTHOR:      Will Chang
#+EMAIL:       changwei.cn@gmail.com
#+DATE:        2013-12-19 Thu
#+URI:         /wiki/eclipse
#+KEYWORDS:    eclipse
#+TAGS:        :eclipse:
#+LANGUAGE:    en
#+OPTIONS:     H:3 num:nil toc:nil \n:nil ::t |:t ^:nil -:nil f:t *:t <:t
#+DESCRIPTION: eclipse





 - [[http://www.eclipse.org/webtools/releases/2.0/newandnoteworthy/server.php][Tomcat Publishing Options]]


* heap size

 
 - [[http://lylyb.iteye.com/blog/162799][eclipse JVM 设置]]
* Eclipse Orion  http://orionhub.org/ changwei/7807

http://wiki.eclipse.org/Orion/Getting_Started_with_Orion


<src lang="html">

<!DOCTYPE html>
<html>
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
	<script type="text/javascript" src="../orion/plugin.js"></script>
	<script>
		window.onload = function() {
			var provider = new orion.PluginProvider({postInstallUrl:"../plugin/list.html"});
			provider.registerService("orion.navigate.command", {
				run : function(item) {
					window.alert("Running code on: " + item.Location);
				}
			}, {
				image: "../images/gear.gif",
				name: "Run Code on Single Item",
				id: "sample.commands.sample1",
				forceSingleItem: true,
				tooltip: "Run plugin code only on single file/dir"
			});
			provider.registerService("orion.navigate.command", {
				run : function(item) {
					return item.Location;
				}
			}, {
				image: "../images/gear.gif",
				name: "Open HTML Raw",
				id: "sample.commands.sample2",
				forceSingleItem: true,
				href: true,
				contentType: ["text/html"],
				tooltip: "Link to raw html on server"
			});
			
			provider.registerService("orion.navigate.command", {
				run : function(items) {
					var locations = [];
					for (var i = 0; i<items.length; i++) {
						locations.push(items[i].Location);
					}
					window.alert("Bulk operation on: " + locations);
				}
			}, {
				image: "../images/gear.gif",
				name: "Bulk Item Command",
				id: "sample.commands.sample3",
				tooltip: "Bulk command operates on selections"
			});

			provider.registerService("orion.navigate.command", {}, {
				image: "http://www.google.com/favicon.ico",
				name: "Google Search",
				id: "sample.commands.sample4",
				forceSingleItem: true,
				uriTemplate: "http://www.google.com/#q={Name}",
				tooltip: "Link to google search for this file name"
			});
				
			provider.connect();
		};
	</script>
</head>
<body>
</body>
</html>

</src>


* Plugin development

[[http://www.eclipse.org/articles/article.php?file=Article-Eclipse-and-Maven2/index.html][Building Eclipse Plugins with Maven 2]]

* short cut

http://baike.baidu.com/view/2287016.htm


* [[http://www.javaeye.com/topic/633824][Eclipse调试常用技巧]]

* Eclipse Plugin FileSync

There is an Eclipse Plugin FileSync. It is convenient for changed files synchronization. Maybe it is helpful.

FileSync plugin for Eclipse is a file synchronization tool. The main goal is to keep files outside of Eclipse projects in-sync with Eclipse project files. The plugin works as builder in Eclipse and will synchronize all changes on Eclipse project files to mapped external folders. E.g. if a file is created, changed or deleted in Eclipse, then the mapped (external) file will be created, changed or deleted too. Please note, that synchronization works is only in one direction - from Eclipse to the rest of the world. 

The issue that WID7 can not deploy the changed files to server automatically can be solved by this Eclipse plugin tool.
So The changed file can be deployed to the server directly without other additional action by this tool.


Install FileSync

From the WID7 Menu Select: Help->Software Update...-> Available Software

Add site with location : http://andrei.gmxhome.de/eclipse/

unwrap the added site, and select the FileSync plugin. Eclipse 3.3- 3.4 plugins will be the suitable one for WID7


and then .

After install the plugin, restart the WID7.



Settings

Right Click on the Project, and Select "Properties". Now we can see there is a property "File Synchronization" in the Properties.

Enable the checkbox "Enable FileSync builder for project", Add the Synchronize source folder  and set the "Default target folder:" as publish dir.

Also we can double click the Included to set the synchronization file filters.



* 工作中用到Eclipse插件


 - SVN http://subclipse.tigris.org/
 - CollabNet Merge Client http://desktop-eclipse.open.collab.net/
 - MVN 
 - Easy Explore
 - ibatis
 - JD-Eclipse plugin
 - Tao-ReviewBoard
 - Veloeclipse



* ObjectAid UML Explorer
Is what I used. It is easily installed from the repository:

Name:     ObjectAid UML Explorer
Location: http://www.objectaid.com/update
