wiki/eclipse/index.html
<!DOCTYPE html>
<html lang="en-us">
  <head>
    <title>Eclipse - Keep going</title>
    <meta charset="utf-8" />
    <meta name="author" content="Will Chang" />
    <meta name="description" content="eclipse" />
    <meta name="keywords" content="eclipse" />
    <link rel="stylesheet" href="/media/css/main.css" type="text/css">
  </head>
  <body class="container">
    <div>
      <header class="masthead">
        <h1 class="masthead-title"><a href="/">Keep going</a></h1>
        <p>努力超越自己！</p>
        <ul>
          <li><a href="/%appdata%/">%appdata%</a></li>
          <li><a href="/blog/">Blog</a></li>
          <li><a href="/wiki/">Wiki</a></li>
          <li><a href="/tags/">Tags</a></li>
          <li><a href="/about/">About</a></li>
          <li><a href="https://github.com/standino">GitHub</a></li>
          <li><a href="/rss.xml">RSS</a></li>
        </ul>
        <form method="get" id="searchform" action="http://www.google.com/search">
          <input type="text" class="field" name="q" id="s" placeholder="Search">
          <input type="hidden" name="q" value="site:standino.github.io">
        </form>
      </header>
    </div>

<div>
<div class="post">
<h1>Eclipse</h1>
<ul class="org-ul">
<li><a href="http://www.eclipse.org/webtools/releases/2.0/newandnoteworthy/server.php">Tomcat Publishing Options</a>
</li>
</ul>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">heap size</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><a href="http://lylyb.iteye.com/blog/162799">eclipse JVM 设置</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Eclipse Orion  <a href="http://orionhub.org/">http://orionhub.org/</a> changwei/7807</h2>
<div class="outline-text-2" id="text-2">
<p>
<a href="http://wiki.eclipse.org/Orion/Getting_Started_with_Orion">http://wiki.eclipse.org/Orion/Getting_Started_with_Orion</a>
</p>


<p>
&lt;src lang="html"&gt;
</p>

<p>
&lt;!DOCTYPE html&gt;
&lt;html&gt;
&lt;head&gt;
        &lt;meta http-equiv="Content-Type" content="text/html; charset=UTF-8"&gt;
        &lt;script type="text/javascript" src="../orion/plugin.js"&gt;&lt;/script&gt;
        &lt;script&gt;
                window.onload = function() {
                        var provider = new orion.PluginProvider({postInstallUrl:"../plugin/list.html"});
                        provider.registerService("orion.navigate.command", {
                                run : function(item) {
                                        window.alert("Running code on: " + item.Location);
                                }
                        }, {
                                image: "../images/gear.gif",
                                name: "Run Code on Single Item",
                                id: "sample.commands.sample1",
                                forceSingleItem: true,
                                tooltip: "Run plugin code only on single file/dir"
                        });
                        provider.registerService("orion.navigate.command", {
                                run : function(item) {
                                        return item.Location;
                                }
                        }, {
                                image: "../images/gear.gif",
                                name: "Open HTML Raw",
                                id: "sample.commands.sample2",
                                forceSingleItem: true,
                                href: true,
                                contentType: ["text/html"],
                                tooltip: "Link to raw html on server"
                        });
</p>

<p>
provider.registerService("orion.navigate.command", {
        run : function(items) {
                var locations = [];
                for (var i = 0; i&lt;items.length; i++) {
                        locations.push(items[i].Location);
                }
                window.alert("Bulk operation on: " + locations);
        }
}, {
        image: "../images/gear.gif",
        name: "Bulk Item Command",
        id: "sample.commands.sample3",
        tooltip: "Bulk command operates on selections"
});
</p>

<p>
provider.registerService("orion.navigate.command", {}, {
        image: "<a href="http://www.google.com/favicon.ico">http://www.google.com/favicon.ico</a>",
        name: "Google Search",
        id: "sample.commands.sample4",
        forceSingleItem: true,
        uriTemplate: "<a href="http://www.google.com/#q={Name">http://www.google.com/#q={Name</a>}",
        tooltip: "Link to google search for this file name"
});
</p>

<p>
                        provider.connect();
                };
        &lt;/script&gt;
&lt;/head&gt;
&lt;body&gt;
&lt;/body&gt;
&lt;/html&gt;
</p>

<p>
&lt;/src&gt;
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Plugin development</h2>
<div class="outline-text-2" id="text-3">
<p>
<a href="http://www.eclipse.org/articles/article.php?file=Article-Eclipse-and-Maven2/index.html">Building Eclipse Plugins with Maven 2</a>
</p>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">short cut</h2>
<div class="outline-text-2" id="text-4">
<p>
<a href="http://baike.baidu.com/view/2287016.htm">http://baike.baidu.com/view/2287016.htm</a>
</p>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><a href="http://www.javaeye.com/topic/633824">Eclipse调试常用技巧</a></h2>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">Eclipse Plugin FileSync</h2>
<div class="outline-text-2" id="text-6">
<p>
There is an Eclipse Plugin FileSync. It is convenient for changed files synchronization. Maybe it is helpful.
</p>

<p>
FileSync plugin for Eclipse is a file synchronization tool. The main goal is to keep files outside of Eclipse projects in-sync with Eclipse project files. The plugin works as builder in Eclipse and will synchronize all changes on Eclipse project files to mapped external folders. E.g. if a file is created, changed or deleted in Eclipse, then the mapped (external) file will be created, changed or deleted too. Please note, that synchronization works is only in one direction - from Eclipse to the rest of the world. 
</p>

<p>
The issue that WID7 can not deploy the changed files to server automatically can be solved by this Eclipse plugin tool.
So The changed file can be deployed to the server directly without other additional action by this tool.
</p>


<p>
Install FileSync
</p>

<p>
From the WID7 Menu Select: Help-&gt;Software Update...-&gt; Available Software
</p>

<p>
Add site with location : <a href="http://andrei.gmxhome.de/eclipse/">http://andrei.gmxhome.de/eclipse/</a>
</p>

<p>
unwrap the added site, and select the FileSync plugin. Eclipse 3.3- 3.4 plugins will be the suitable one for WID7
</p>


<p>
and then .
</p>

<p>
After install the plugin, restart the WID7.
</p>



<p>
Settings
</p>

<p>
Right Click on the Project, and Select "Properties". Now we can see there is a property "File Synchronization" in the Properties.
</p>

<p>
Enable the checkbox "Enable FileSync builder for project", Add the Synchronize source folder  and set the "Default target folder:" as publish dir.
</p>

<p>
Also we can double click the Included to set the synchronization file filters.
</p>
</div>
</div>


<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">工作中用到Eclipse插件</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li>SVN <a href="http://subclipse.tigris.org/">http://subclipse.tigris.org/</a>
</li>
<li>CollabNet Merge Client <a href="http://desktop-eclipse.open.collab.net/">http://desktop-eclipse.open.collab.net/</a>
</li>
<li>MVN 
</li>
<li>Easy Explore
</li>
<li>ibatis
</li>
<li>JD-Eclipse plugin
</li>
<li>Tao-ReviewBoard
</li>
<li>Veloeclipse
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8">ObjectAid UML Explorer</h2>
<div class="outline-text-2" id="text-8">
<p>
Is what I used. It is easily installed from the repository:
</p>

<p>
Name:     ObjectAid UML Explorer
Location: <a href="http://www.objectaid.com/update">http://www.objectaid.com/update</a>
</p>
</div>
</div>

</div>
</div>
    <div>
      <div class="post-meta">
        <span title="post date" class="post-info">2013-12-19</span>
        <span title="last modification date" class="post-info">2013-12-19</span>
        <span title="tags" class="post-info"><a href="/tags/eclipse/">eclipse</a></span>
        <span title="author" class="post-info">Will Chang</span>
      </div>
      <section>
        <h1>Comments</h1>
        <div id="disqus_thread"></div>
        <script type="text/javascript">
          //var disqus_developer = 1;
          var disqus_identifier = "/wiki/eclipse";
          var disqus_url = "http://standino.github.io/wiki/eclipse";
          var disqus_shortname = 'standino';
          /* * * DON'T EDIT BELOW THIS LINE * * */
          (function() {
          var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
          dsq.src = 'http://' + disqus_shortname + '.disqus.com/embed.js';
          (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
          })();
        </script>
        <noscript>Please enable JavaScript to view the <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
        <a href="http://disqus.com" class="dsq-brlink">comments powered by <span class="logo-disqus">Disqus</span></a>
      </section>
      <script type="text/javascript">
        var _gaq = _gaq || [];
        _gaq.push(['_setAccount', 'UA-46515756-1']);
        _gaq.push(['_trackPageview']);
        (function() {
        var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
        ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
        var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
        })();
      </script>
      <div class="footer">
        <p>Generated by <a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.4)</p>
        <p>
          Copyright &copy; 2012 - 2013 <a href="mailto:changwei &lt;dot&gt; cn &lt;at&gt; gmail &lt;dot&gt; com">Will Chang</a>
          &nbsp;&nbsp;-&nbsp;&nbsp;
          Powered by <a href="https://github.com/kelvinh/org-page" target="_blank">org-page</a>
        </p>
      </div>
    </div>

  </body>
</html>
